
#Область СлужебныеПроцедурыИФункции
//Прочитать сообщения пользователям
Процедура ПрочитатьСообщенияПользователя() Экспорт
	

// Получаем все записи справочника

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УведомлениеТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
	|	ВКМ_УведомлениеТелеграмБоту.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВКМ_УведомлениеТелеграмБоту.Ссылка) КАК УИН
	|ИЗ
	|	Справочник.ВКМ_УведомлениеТелеграмБоту КАК ВКМ_УведомлениеТелеграмБоту";

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
	Сообщение = ВыборкаДетальныеЗаписи.ТекстСообщения;
	
	Token = Константы.ВКМ_ТокенУправленияТелеграммБотом.Получить();
	Соединение = Новый HTTPСоединение("api.telegram.org",443 , , , , ,Новый ЗащищенноеСоединениеOpenSSL());
	
	IDЧата = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

	Объект = Новый Структура();
	Объект.Вставить("chat_id", IDЧата);
	Объект.Вставить("text", Сообщение);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Объект);
	СтрокаJSON = Запись.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	Источник = "bot" + Token + "/sendMessage";
	Запрос = Новый HTTPЗапрос(Источник, Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	HTTPОтвет = Соединение.ОтправитьДляОбработки(Запрос);
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
	
	ЗаписьЖурналаРегистрации("ПрочитатьСообщенияПользователя", УровеньЖурналаРегистрации.Ошибка, , ,HTTPОтвет.ПолучитьТелоКакСтроку())
	
	КонецЕсли;
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
	
	ЗаписьСправочника = Справочники.ВКМ_УведомлениеТелеграмБоту.ПолучитьСсылку(ВыборкаДетальныеЗаписи.УИН).ПолучитьОбъект();
	ЗаписьСправочника.Удалить();
	
	КонецЕсли;
	
КонецЦикла;
	
КонецПроцедуры

#КонецОбласти