#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументы(Период) Экспорт


Запрос = Новый Запрос;
Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор КАК Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Владелец КАК Контрагент,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Организация КАК Организация
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботыРег КАК ВКМ_ВыполненныеКлиентуРаботыРег
		|ГДЕ
		|	НЕ ВКМ_ВыполненныеКлиентуРаботыРег.Договор В
		|		(ВЫБРАТЬ
		|			РеализацияТоваровУслуг.Договор КАК Договор
		|		ИЗ
		|			Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ГДЕ
		|			РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КОнецПериода
		|			И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора)
		|	И ВКМ_ВыполненныеКлиентуРаботыРег.Период МЕЖДУ &НачалоПериода И &КОнецПериода
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Владелец,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Организация";

Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));


РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Результат = Новый Массив;

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		
	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокумент.Дата = Период.ДатаОкончания;
	ЗаполнитьЗначенияСвойств(НовыйДокумент, ВыборкаДетальныеЗаписи);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	НовыйДокумент.ВыполнитьАвтозаполнение();
	
	ДанныеЗаполненияТЧ = Новый Структура();
	ДанныеЗаполненияТЧ.Вставить("Договор",ВыборкаДетальныеЗаписи.Договор);
	ДанныеЗаполненияТЧ.Вставить("Контрагент", ВыборкаДетальныеЗаписи.Контрагент);
	ДанныеЗаполненияТЧ.Вставить("Ссылка",НовыйДокумент.Ссылка);
	
	Результат.Добавить(ДанныеЗаполненияТЧ);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);

КонецЦикла;

Возврат Результат;

КонецФункции


#КонецОбласти