#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументы(Период) Экспорт
	
	// Проверяем и при необходимости перезаполняем уже созданные документы
	
	Запрос = Новый Запрос;
Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыРегОстатки.КоличествоЧасовОстаток КАК КоличествоЧасовОстаток,
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	ВКМ_ВыполненныеКлиентуРаботыРегОстатки.Клиент КАК Клиент,
		|	ВКМ_ВыполненныеКлиентуРаботыРегОстатки.Договор КАК Договор,
		|	РеализацияТоваровУслуг.Номер КАК Номер
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботыРег.Остатки КАК ВКМ_ВыполненныеКлиентуРаботыРегОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВКМ_ВыполненныеКлиентуРаботыРегОстатки.Клиент = РеализацияТоваровУслуг.Контрагент
		|		И ВКМ_ВыполненныеКлиентуРаботыРегОстатки.Договор = РеализацияТоваровУслуг.Договор
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
		|	И ВКМ_ВыполненныеКлиентуРаботыРегОстатки.КоличествоЧасовОстаток <> 0";

Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));

РезультатЗапросаПроверки = Запрос.Выполнить();

Выборка = РезультатЗапросаПроверки.Выбрать();

Пока Выборка.Следующий() Цикл
	
	ДокументПерезаполнения = Выборка.Ссылка.ПолучитьОбъект();
	ДокументПерезаполнения.ВыполнитьАвтозаполнение();
	ДокументПерезаполнения.Записать(РежимЗаписиДокумента.Проведение);
	
КонецЦикла;
	
	// Создаём документы которые не создавались ранее в заданном периоде


Запрос = Новый Запрос;
Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор КАК Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Владелец КАК Контрагент,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Организация КАК Организация
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботыРег КАК ВКМ_ВыполненныеКлиентуРаботыРег
		|ГДЕ
		|	НЕ ВКМ_ВыполненныеКлиентуРаботыРег.Договор В
		|				(ВЫБРАТЬ
		|					РеализацияТоваровУслуг.Договор КАК Договор
		|				ИЗ
		|					Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|				ГДЕ
		|					РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КОнецПериода
		|					И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
		|					И РеализацияТоваровУслуг.Проведен = ИСТИНА)
		|	И ВКМ_ВыполненныеКлиентуРаботыРег.Период МЕЖДУ &НачалоПериода И &КОнецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Владелец,
		|	ВКМ_ВыполненныеКлиентуРаботыРег.Договор.Организация";

Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));


РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Результат = Новый Массив;

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		
	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокумент.Дата = Период.ДатаОкончания;
	ЗаполнитьЗначенияСвойств(НовыйДокумент, ВыборкаДетальныеЗаписи);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	НовыйДокумент.ВыполнитьАвтозаполнение();
	
	ДанныеЗаполненияТЧ = Новый Структура();
	ДанныеЗаполненияТЧ.Вставить("Договор",ВыборкаДетальныеЗаписи.Договор);
	ДанныеЗаполненияТЧ.Вставить("Контрагент", ВыборкаДетальныеЗаписи.Контрагент);
	ДанныеЗаполненияТЧ.Вставить("Ссылка",НовыйДокумент.Ссылка);
	
	Результат.Добавить(ДанныеЗаполненияТЧ);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);

КонецЦикла;

Возврат Результат;

КонецФункции


#КонецОбласти