
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РазмерНДФЛ = Константы.ВКМ_РазмерНДФЛ.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.НомерСтроки КАК НомерСтроки,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.СуммаПремии КАК Начисление,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
		|ГДЕ
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//ДвижениеПремия = Движения.ВКМ_ПремииСотрудникамРег.Добавить();
		ДвижениеПремия = Движения.ВКМ_ДополнительныеНачисленияРег.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеПремия, ВыборкаДетальныеЗаписи);
		ДвижениеПремия.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		ДвижениеПремия.ПериодРегистрации = НачалоМесяца(Дата); 
		ДвижениеПремия.СуммаКОплате = ВыборкаДетальныеЗаписи.Начисление;

		
		ДвижениеУдержания = Движения.ВКМ_УдержанияРег.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеУдержания, ВыборкаДетальныеЗаписи);
		ДвижениеУдержания.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.УдержаниеНДФЛ;
		ДвижениеУдержания.ПериодРегистрации = НачалоМесяца(Дата);
		ДвижениеУдержания.Показатель = РазмерНДФЛ;
		ДвижениеУдержания.Начисление = (ВыборкаДетальныеЗаписи.Начисление * РазмерНДФЛ) / 100; 
		
		
		ДвижениеВзаиморасчетыССотрудниками = Движения.ВКМ_ВзаиморасчетыССотрудникамиРег.Добавить();
		ДвижениеВзаиморасчетыССотрудниками.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчетыССотрудниками.Период = НачалоМесяца(Дата);
		ДвижениеВзаиморасчетыССотрудниками.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		ДвижениеВзаиморасчетыССотрудниками.Сумма = ДвижениеПремия.СуммаКОплате - ДвижениеУдержания.Начисление;
		
		
		
	КонецЦикла;
	
		Движения.ВКМ_ДополнительныеНачисленияРег.Записать();
		Движения.ВКМ_УдержанияРег.Записать();
		Движения.ВКМ_ВзаиморасчетыССотрудникамиРег.Записать();
		
Конецпроцедуры


#КонецОбласти