
// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ВКМ_ОбслуживаниеКлиентов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Номер КАК Номер,
		|	ВКМ_ОбслуживаниеКлиентов.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВыполненныеРаботы.(
		|		НомерСтроки КАК НомерСтроки,
		|		ОписаниеРабот КАК ОписаниеРабот,
		|		ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
		|		ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту) КАК ВыполненныеРаботы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВыполненныеРаботыШапка = Макет.ПолучитьОбласть("ВыполненныеРаботыШапка");
	ОбластьВыполненныеРаботы = Макет.ПолучитьОбласть("ВыполненныеРаботы");
	ОбластьИтого = Макет.ПолучитьОбласть("ОбластьИтогов");
	ОбластьПодписи = Макет.ПолучитьОбласть("ОбластьПодписи");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	ИтогоЧасовПотрачено = 0;
	ИтогоЧасовКОплате = 0;
	
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		ТабДок.Вывести(ОбластьВыполненныеРаботыШапка);
		ВыборкаВыполненныеРаботы = Выборка.ВыполненныеРаботы.Выбрать();
		Пока ВыборкаВыполненныеРаботы.Следующий() Цикл
			ОбластьВыполненныеРаботы.Параметры.Заполнить(ВыборкаВыполненныеРаботы);
			ТабДок.Вывести(ОбластьВыполненныеРаботы, ВыборкаВыполненныеРаботы.Уровень());
				
		ИтогоЧасовПотрачено = ИтогоЧасовПотрачено + ВыборкаВыполненныеРаботы.ФактическиПотраченоЧасов;
		ИтогоЧасовКОплате = ИтогоЧасовКОплате + ВыборкаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		КонецЦикла;
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ИтогоЧасовПотрачено", ИтогоЧасовПотрачено);
		ДополнительныеПараметры.Вставить("ИтогоЧасовКОплате", ИтогоЧасовКОплате);
		
		ОбластьИтого.Параметры.Заполнить(ДополнительныеПараметры);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	
	ТабДок.Вывести(ОбластьИтого);
	ТабДок.Вывести(ОбластьПодписи);
	
КонецПроцедуры
