
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполнение диаграммы Ганта
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	
	ДанныеДляГанта = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	ЭлементыМеток = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ЭлементыМеток.Единица = ТипЕдиницыШкалыВремени.Месяц;
	ЭлементыМеток.Кратность = 1;
	ЭлементыМеток.Формат = "ДФ=MMMM.yyyy";
	
	Для Каждого Запись Из ДанныеДляГанта Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(Запись.Сотрудник);
		Точка.Текст = Запись.Сотрудник;
		Серия = ДиаграммаГанта.УстановитьСерию(Запись.Год);
//		Серия.Текст = Год(Запись.Год);
		Серия.Текст = Запись.Год;		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Запись.ДатаНачала;
		Интервал.Конец = Запись.ДатаОкончания;
		
	КонецЦикла; 
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры
