Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если РольДоступна("ПолныеПрава") Тогда
		
		ДанныеВыбора = Новый СписокЗначений;
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.Открыт);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "Открыт");
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.НазначенОтветственному);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "Назначен ответственному");
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.ВнесеныКорректировки);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "Внесены корректировки");
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.ВРаботе);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "В работе");
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.Выполнен);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "Выполнен");
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.Закрыт);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "Закрыт");	
		
	ИначеЕсли РольДоступна("ВКМ_ДобавлениеОбслуживаниеКлиентовМенеджер")  Тогда
		
		ДанныеВыбора = Новый СписокЗначений;
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.Открыт);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "Открыт");
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.НазначенОтветственному);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "Назначен ответственному");
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.ВнесеныКорректировки);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "Внесены корректировки");
		
		//    	КонецЕсли;
		
		
	ИначеЕсли РольДоступна("ВКМ_ДобавлениеИзменениеОбслуживаниеКлиентов") Тогда
		
		ДанныеВыбора = Новый СписокЗначений;
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.ВРаботе);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "В работе");
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.Выполнен);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "Выполнен");
		
		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Перечисления.ВКМ_СтатусыЗаявокНаОбслуживание.Закрыт);
		ЗначениеСписка.Вставить("ПометкаУдаления", Ложь);
		ДанныеВыбора.Добавить(ЗначениеСписка, "Закрыт");
		
	КонецЕсли;
	
	//	КонецЕсли;
	
КонецПроцедуры