////ВКМ_Старт
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Не Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	
	Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	
	Иначе
	
	Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
	Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Истина;
	Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
Если Не Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	
	Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	
КонецЕсли;

КонецПроцедуры
////ВКМ_Стоп
