
&НаСервере
Процедура ЗаполнитьЗадолжностьюНаСервере()
	
	Объект.Выплаты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиРегОстатки.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиРегОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудникамиРег.Остатки(&Дата, ) КАК ВКМ_ВзаиморасчетыССотрудникамиРегОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВзаиморасчетыССотрудникамиРегОстатки.Сотрудник";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Записи для заполнения табличной части отсутствуют";
		Сообщение.Сообщить();
		
	Иначе
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			 
	НоваяСтрокаТЧ = Объект.Выплаты.Добавить();
	НоваяСтрокаТЧ.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
	НоваяСтрокаТЧ.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
		 	 
	КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗадолжностью(Команда)
	ЗаполнитьЗадолжностьюНаСервере();
КонецПроцедуры
