
&НаСервере
Процедура ПериодПриИзмененииНаСервере(Период)
	
	Объект.СписокДоговоров.Очистить();

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
	|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА";

Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		НоваяСтрока = Объект.СписокДоговоров.Добавить();
		НоваяСтрока.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		НоваяСтрока.Договор = ВыборкаДетальныеЗаписи.Договор;
		НоваяСтрока.Реализация = ВыборкаДетальныеЗаписи.Ссылка;
		
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере(Объект.Период);
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,"ВКМ_ГрупповоеСозданиеРНСервер.СоздатьДокументы", Объект.Период);
	
КонецФункции

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	ДлительнаяОперация = НачатьВыполнениеНаСервере();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
     Если Результат = Неопределено Тогда
     	
      Возврат;
      
     Иначе
     	
     	РезультатТЧ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Для Каждого Строка Из РезультатТЧ Цикл 
		
		НоваяСтрока = Объект.СписокДоговоров.Добавить();
		НоваяСтрока.Контрагент = Строка.Контрагент;
		НоваяСтрока.Договор = Строка.Договор;
		НоваяСтрока.Реализация = Строка.Ссылка;
		
	КонецЦикла;
   
КонецЕсли; 
    
КонецПроцедуры 
